//Вывести на экран квадрат из 10х10 букв S используя цикл while.
//Буквы в каждой строке не разделять.
package tasks;

public class Program13 {

	public static void main(String[] args) {
		String s = "SSSSSSSSSS";
		int i = 1;
		
		while(i<=10){
			System.out.println(s);
			i++;
		}

	}

}
